spec/cassettes/RollYourOwnMarket/creates_new_/bank_account.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: description=%5BTest%5D%20Market%205&metadata[lo.entity_id]=9&metadata[lo.entity_type]=organization
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.2
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.2","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.13.0-83-generic (buildd@lgw01-55) (gcc version 4.8.2 (Ubuntu 4.8.2-19ubuntu1)
        ) #127-Ubuntu SMP Fri Mar 11 00:25:37 UTC 2016","hostname":"keith-Latitude-E7450"}'
      Content-Length:
      - '98'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 Apr 2016 21:30:43 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '930'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8BxmRJcufE4iIk
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_8Bxm7ULRhK7Lcc",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_8Bxm7ULRhK7Lcc/bank_accounts"
          },
          "created": 1459546243,
          "currency": null,
          "default_bank_account": null,
          "default_source": null,
          "default_source_type": null,
          "delinquent": false,
          "description": "[Test] Market 5",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {
            "lo.entity_id": "9",
            "lo.entity_type": "organization"
          },
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_8Bxm7ULRhK7Lcc/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_8Bxm7ULRhK7Lcc/subscriptions"
          }
        }
    http_version: 
  recorded_at: Fri, 01 Apr 2016 21:30:43 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4012888888881881&card[exp_month]=5&card[exp_year]=2016&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.2
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.2","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.13.0-83-generic (buildd@lgw01-55) (gcc version 4.8.2 (Ubuntu 4.8.2-19ubuntu1)
        ) #127-Ubuntu SMP Fri Mar 11 00:25:37 UTC 2016","hostname":"keith-Latitude-E7450"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 Apr 2016 21:30:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8Bxm0eYNDzveaL
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_17vZqp2VpjOYk6TmfAC62ALb",
          "object": "token",
          "card": {
            "id": "card_17vZqp2VpjOYk6TmFMQ1IRaE",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 5,
            "exp_year": 2016,
            "fingerprint": "q7xiTNu65zbddK8U",
            "funding": "credit",
            "last4": "1881",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "50.77.209.166",
          "created": 1459546243,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Fri, 01 Apr 2016 21:30:43 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: description=Walrus%20Flower&metadata[lo.entity_id]=10&metadata[lo.entity_type]=market
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.2
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.2","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.13.0-83-generic (buildd@lgw01-55) (gcc version 4.8.2 (Ubuntu 4.8.2-19ubuntu1)
        ) #127-Ubuntu SMP Fri Mar 11 00:25:37 UTC 2016","hostname":"keith-Latitude-E7450"}'
      Content-Length:
      - '85'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 Apr 2016 21:30:45 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '923'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8BxmjuELKwbDl6
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_8BxmI7ZXq0jnzk",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_8BxmI7ZXq0jnzk/bank_accounts"
          },
          "created": 1459546245,
          "currency": null,
          "default_bank_account": null,
          "default_source": null,
          "default_source_type": null,
          "delinquent": false,
          "description": "Walrus Flower",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {
            "lo.entity_id": "10",
            "lo.entity_type": "market"
          },
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_8BxmI7ZXq0jnzk/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_8BxmI7ZXq0jnzk/subscriptions"
          }
        }
    http_version: 
  recorded_at: Fri, 01 Apr 2016 21:30:45 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_8BxmI7ZXq0jnzk
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.2
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.2","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.13.0-83-generic (buildd@lgw01-55) (gcc version 4.8.2 (Ubuntu 4.8.2-19ubuntu1)
        ) #127-Ubuntu SMP Fri Mar 11 00:25:37 UTC 2016","hostname":"keith-Latitude-E7450"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 Apr 2016 21:30:46 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '923'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8BxmXfLBG4Wvpv
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_8BxmI7ZXq0jnzk",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_8BxmI7ZXq0jnzk/bank_accounts"
          },
          "created": 1459546245,
          "currency": null,
          "default_bank_account": null,
          "default_source": null,
          "default_source_type": null,
          "delinquent": false,
          "description": "Walrus Flower",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {
            "lo.entity_id": "10",
            "lo.entity_type": "market"
          },
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_8BxmI7ZXq0jnzk/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_8BxmI7ZXq0jnzk/subscriptions"
          }
        }
    http_version: 
  recorded_at: Fri, 01 Apr 2016 21:30:46 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_8BxmI7ZXq0jnzk/subscriptions
    body:
      encoding: US-ASCII
      string: plan=GROW&source=tok_17vZqp2VpjOYk6TmfAC62ALb&metadata[lo.entity_id]=10&metadata[lo.entity_type]=market
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.2
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.2","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.13.0-83-generic (buildd@lgw01-55) (gcc version 4.8.2 (Ubuntu 4.8.2-19ubuntu1)
        ) #127-Ubuntu SMP Fri Mar 11 00:25:37 UTC 2016","hostname":"keith-Latitude-E7450"}'
      Content-Length:
      - '103'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 Apr 2016 21:30:47 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '830'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8BxmxLrRlciwAt
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_8Bxm6jjIzFbDp3",
          "object": "subscription",
          "application_fee_percent": null,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "current_period_end": 1491082246,
          "current_period_start": 1459546246,
          "customer": "cus_8BxmI7ZXq0jnzk",
          "discount": null,
          "ended_at": null,
          "metadata": {
            "lo.entity_id": "10",
            "lo.entity_type": "market"
          },
          "plan": {
            "id": "GROW",
            "object": "plan",
            "amount": 79900,
            "created": 1453489664,
            "currency": "usd",
            "interval": "year",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "name": "Local Orbit Grow Plan",
            "statement_descriptor": null,
            "trial_period_days": null
          },
          "quantity": 1,
          "start": 1459546246,
          "status": "active",
          "tax_percent": null,
          "trial_end": null,
          "trial_start": null
        }
    http_version: 
  recorded_at: Fri, 01 Apr 2016 21:30:47 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices?customer=cus_8BxmI7ZXq0jnzk
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.2
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.2","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.13.0-83-generic (buildd@lgw01-55) (gcc version 4.8.2 (Ubuntu 4.8.2-19ubuntu1)
        ) #127-Ubuntu SMP Fri Mar 11 00:25:37 UTC 2016","hostname":"keith-Latitude-E7450"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 Apr 2016 21:30:48 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2293'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8BxmDQgvpthlMG
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "data": [
            {
              "id": "in_17vZqs2VpjOYk6Tm2eUqKO3P",
              "object": "invoice",
              "amount_due": 79900,
              "application_fee": null,
              "attempt_count": 1,
              "attempted": true,
              "charge": "ch_17vZqs2VpjOYk6TmyAZtpqCN",
              "closed": true,
              "currency": "usd",
              "customer": "cus_8BxmI7ZXq0jnzk",
              "date": 1459546246,
              "description": null,
              "discount": null,
              "ending_balance": 0,
              "forgiven": false,
              "lines": {
                "object": "list",
                "data": [
                  {
                    "id": "sub_8Bxm6jjIzFbDp3",
                    "object": "line_item",
                    "amount": 79900,
                    "currency": "usd",
                    "description": null,
                    "discountable": true,
                    "livemode": false,
                    "metadata": {
                      "lo.entity_id": "10",
                      "lo.entity_type": "market"
                    },
                    "period": {
                      "start": 1459546246,
                      "end": 1491082246
                    },
                    "plan": {
                      "id": "GROW",
                      "object": "plan",
                      "amount": 79900,
                      "created": 1453489664,
                      "currency": "usd",
                      "interval": "year",
                      "interval_count": 1,
                      "livemode": false,
                      "metadata": {},
                      "name": "Local Orbit Grow Plan",
                      "statement_descriptor": null,
                      "trial_period_days": null
                    },
                    "proration": false,
                    "quantity": 1,
                    "subscription": null,
                    "type": "subscription"
                  }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_17vZqs2VpjOYk6Tm2eUqKO3P/lines"
              },
              "livemode": false,
              "metadata": {},
              "next_payment_attempt": null,
              "paid": true,
              "period_end": 1459546246,
              "period_start": 1459546246,
              "receipt_number": null,
              "starting_balance": 0,
              "statement_descriptor": null,
              "subscription": "sub_8Bxm6jjIzFbDp3",
              "subtotal": 79900,
              "tax": null,
              "tax_percent": null,
              "total": 79900,
              "webhooks_delivered_at": null,
              "payment": "ch_17vZqs2VpjOYk6TmyAZtpqCN"
            }
          ],
          "has_more": false,
          "url": "/v1/invoices"
        }
    http_version: 
  recorded_at: Fri, 01 Apr 2016 21:30:48 GMT
recorded_with: VCR 2.9.3
